---
kind: other
id: Properties.T:Autodesk.Revit.DB.InCanvasControlData
source: html/a4a3761a-d0da-7e7f-71b3-880e67dbe3f2.htm
---
# InCanvasControlData Properties

The path to the image file to be used.
 This must be an absolute path to a location on disk.